In [1]:
people = {
     "first": ["Corey", "Jane", "John"],
     "last": ["Schafer", "Doe", "Doe"],
     "email": ["CoreyMSchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]
 }

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ["first","last", "email" ]

In [7]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [ ]:
#df.columns = ["first_name", "last_name", "email"] changing all columns

In [8]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [9]:
df.columns = [x.lower() for x in df.columns] #list comprehension.
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [10]:
#df.columns = df.columns.str.replace("_","a")

In [11]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [12]:
#df.rename(columns={"fist_name":"first", "last_name":"last"}, inplace=True) #changing a particular columns.

In [28]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@email.com

In [14]:
#df.loc[2] = ["John","Smith","JohnSmith@email.com"] #for changing rows specify the unchanged values

In [29]:
#Used for changing rows without specify unchanged values
df.loc[2, ["last","email"]] = ["Doe","JohnDoe@email.com"]

In [30]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        JohnDoe@email.com

In [31]:
df.loc[2, "last"] = "Smith" #for changing a single value
#df.at[2, "last"] = "Doe" #also for changing a single value

In [32]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith        JohnDoe@email.com

In [34]:
df.at[2, "last"] = "Doe"#also for changing a single value

In [35]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        JohnDoe@email.com

In [36]:
filt = (df["email"] == "JohnDoe@email.com")

In [38]:
df.loc[filt,"first"] = "John"
#it won't work without loc. like This----------->
# filt = (df["email"] == "JohnDoe@email.com")
# df[filt]["last"] = "Smith"

In [66]:
df["email"] = df["email"].str.lower()#setting multiples columns

In [91]:
df.loc[[0,1,2],"email"] = ["CoreyMSchafer@gmail.com", "JaneDoe@gmail.com", "JohnDoe@gmail.com"]

In [92]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [79]:
df["email"].apply(len)#gets the length of all rows in the email columns.

0    23
1    17
2    17
Name: email, dtype: int64

In [81]:
def update_email(email):
    return email.upper()

In [82]:
df["email"].apply(update_email) #updating all the specified column.

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@GMAIL.COM
2          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [83]:
df["email"] = df["email"].apply(update_email)

In [93]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [95]:
df["email"] = df["email"].apply(lambda x: x.lower())#also updating all the values in a column using a lambda function on a series

In [96]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com

In [97]:
df["email"].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [100]:
df.apply(len) #applies the len function to each series in the data frame.
#len(df["email"])

3

In [102]:
df.apply(len, axis="columns")#giving the len of each rows in the Data_Frame

0    3
1    3
2    3
dtype: int64

In [105]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com

#Running apply on a series applie a function every values in the series.
#and runing apply to a dataframe applies a function to every series in the dataframe.

In [103]:
df.apply(pd.Series.min) #getting the minimum value in all Series.

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [104]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [106]:
df.applymap(len) #applies the function to every individual element in the Dataframe.It works with only Data_Frame

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17

In [107]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@gmail.com
2   john      doe        johndoe@gmail.com

In [108]:
df["first"].map({"Corey": "Chris", "Jane":"Mary"}) #map and replace works with Series Objects changing values in a series.When Using Map Anything not 
#specified will converted to an NaN Value but Replace doesn't convert it.

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [110]:
df["first"] = df["first"].replace({"Corey": "Chris", "Jane":"Mary"})

In [111]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@gmail.com
2   John      Doe        johndoe@gmail.com